{"dateText": "No date", "dateFormated": "1859-00-00", "cityOrState": "Topeka, Kas.", "geographicalLocations": ["Indian creek", "Shawnee county", "Fort Leavenworth", "Fort Riley", "Kaw river", "Bluffs"], "people": ["William Tecumseh Sherman", "Peter Moyer", "John Ogee", "O.Z. Goodrich"], "fullText": "There is a queer old tumble down cabin on the banks of Indian creek, near Topeka, Kas., which has an historical interest of more than ordinary importance. It is a frame structure of two rooms. At present it is in a somewhat dilapidated condition, but at one time it was a comfortable home. It is twenty-three feet in length by twelve in width, with a partition in the center. The house stands on a beautiful patch of ground which is bounded on the west by Little Indian creek, on the south by the old government trail and on the east an north by well cultivated farms. It faces the east and is on an elevation. There is a cellar under the north half of the old cabin. At present it is unoccupied, and the neighbors in the vicinity declare that it is haunted. A short distance from it Mr. Peter Moyer built a house, and lives there; he isn't afraid of ghosts.\n\nThe old house has a far greater historical importance than mere age gives, for its timbers were laid in position, the walls plastered, and the roof fastened by the hand of a man who was at once a great scholar and a great general -- a hero of the late war. It was no other than General William Tecumseh Sherman. He built and lived in this cabin in 1859. In 1858 he was engaged in the practice of law at Leavenworth, Kas. Like many young lawyers, he found that his receipts were not large enough to meet his expenses and so he decided to turn farmer for a time and try too add to his income. To that end he purchased some land in the northeastern part of Shawnee county, six miles north of Topeka, Kas. His selection was an admirable one. The pretty little stream which the early settlers had named Indian creek, ran along just west of it, and there was considerable timber on the land. Many of the big trees have been cut down. The old military trail ran near to it on the south, being a thoroughfare between Fort Leavenworth and Fort Riley. It was a beautiful place and it is no wonder that the general liked it. In the early spring of 1859 he built his humble cabin.\n\nAs shown in the picture, it consists of two rooms. The general simply built a one room structure, the other room having been added a few years afterward. He built the section shown on the right in the picture. He also dug the cellar under it; for Kansas was just as hot and dry at that time as it is now. It didn't take long to make the cabin ready for occupancy, and William T. Sherman, farmer, was soon living in his own domicile and tilling the rich soil on his place -- one of the prettiest spots in Kansas. Indian Creek was then a stream in which there was plenty of water and a somewhat swift current. It flows into the Kaw river five miles east of Topeka.\n\nDown on the east bank of the creek at a distance of about half a mile from the old cabin was an old saw mill, which was owned and operated by a Pottawatomie Indian by the name of John Ogee. The old fellow had saved his money and bought it. General Sherman sometimes walked down by it to talk with the man who ran the mill. The Indian found that he could get better work done by a white man than by his redskin brothers. An anecdote is told of the general in regard to a conversation he had with John Ogee, the proprietor. One Sunday morning the general took a walk down by the old mill, probably in the hopes of seeing the foreman or some of the neighbors. As he neared the mill he saw John Ogee. The Indian was sitting on a log, smoking his long pipe and looking down in the water, a vacant stare in his eyes. General Sherman knew little of the Indian's language, but Ogee had learned to talk English brokenly. General Sherman approached and saluted him. The latter looked up and nodded his head slightly. Then the general began talking to him. He talked and talked, and asked questions, made observations; bu the Indian replied not a word. He sat and looked down into the water in silence. Finally the general gave up the effort and left the Pottawatomie to his silent meditation. Meeting a neighbor on the way home, he related his unsuccessful interview, and said: \"Well, sir, I've seen lazy people, but that is the first time I ever saw a man that was too lazy to talk.\" John Ogee died only a few years ago; a grandson of his now lives in Topeka.\n\nIt is said that General Sherman made a very good farmer. He was a hard worker, and although he was peculiar he had lots of friends among the settlers of the county. In the spring of 1860 he built another house, which was much larger and more modern than the old cabin. He erected it on a knoll about a quarter of a mile from his first house. It is yet in a good state of preservation, but has never been painted. O.Z. Goodrich, a jolly old farmer, now lives in it, and he loves to tell of the ghost stories that are afloat about the log cabin.\n\nThe picture shows the house as it now stands. It contains seven rooms, the walls are covered with weatherboarding and the roof is of shingles. Probably General Sherman intended living in this comfortable house, but as to whether or not he did is a matter of doubt. Some of the old settlers claim that he did occupy it for a short time, while others deny it. If he made it his home it must have been for a very short time only. From the eminence on which it stands there is a magnificent view of the valley of the Kaw, both east and west. The ridge of hills on which it is located is called the \"Bluffs,\" as it is the first elevation beyond the river bank.\n\nWhen General Sherman was called away he moved his few belongings from his cabin home and said good by to the old place -- forever. It has never been occupied since, though at present Mr. Moyer keeps his farm tools in it. A small barn that the general erected near the cabin has been torn down. There has been some talk of tearing down the house but when it was attempted there was such a vigorous objection made that the project had to be abandoned. It still stands there in its dilapidation, perched well up above the surrounding land. It means a great deal to the old pioneers and they love to look at it. It is a sacred landmark to them and they will never agree to have it torn down.", "summaryText": "General William Tecumseh Sherman built and lived in a cabin in Topeka, Kas. in 1859 while he was a farmer. The cabin is still standing and has historical importance. The cabin was built near Indian creek and the old government trail. Sherman also built a larger house nearby in 1860. The cabin was unoccupied after Sherman left and is now considered a sacred landmark by the old pioneers.", "similar": {"daybook": [[0.8258894705478423, ["daybooks", "mss11049.mss11049-001_00683_00886", "23_2"]], [0.8237054416423149, ["daybooks", "mss11049.mss11049-001_00887_00956", "5_2"]], [0.8200062837998838, ["daybooks", "mss11049.mss11049-004_00685_00905", "102_2"]], [0.8199525841572239, ["daybooks", "mss11049.mss11049-002_00107_00307", "137_1"]], [0.818865288519779, ["daybooks", "mss11049.mss11049-003_00008_00223", "165_2"]], [0.8171515430872063, ["daybooks", "mss11049.mss11049-001_00519_00682", "52_1"]], [0.8164315997978004, ["daybooks", "mss11049.mss11049-001_00683_00886", "110_2"]], [0.8148506843913847, ["daybooks", "mss11049.mss11049-001_00349_00517", "78_2"]], [0.8144910359325224, ["daybooks", "mss11049.mss11049-002_00409_00631", "190_1"]], [0.8133089383890082, ["daybooks", "mss11049.mss11049-002_00409_00631", "156_2"]], [0.8127791672793575, ["daybooks", "mss11049.mss11049-002_00409_00631", "144_1"]], [0.8118108583024914, ["daybooks", "mss11049.mss11049-004_00685_00905", "104_1"]], [0.8117168210736627, ["daybooks", "mss11049.mss11049-001_00349_00517", "105_2"]], [0.811449366659353, ["daybooks", "mss11049.mss11049-002_00409_00631", "150_2"]], [0.8111682592586149, ["daybooks", "mss11049.mss11049-002_00409_00631", "179_2"]], [0.8109522232242455, ["daybooks", "mss11049.mss11049-004_00685_00905", "93_2"]], [0.8100676302194, ["daybooks", "mss11049.mss11049-002_00308_00407", "33_5"]], [0.8100596790437564, ["daybooks", "mss11049.mss11049-001_00683_00886", "90_2"]], [0.8094038480552042, ["daybooks", "mss11049.mss11049-003_00008_00223", "138_2"]]], "writings": [[0.803308294101592, ["writings", "mss11049.mss11049-007_00242_00289", "44_45_46"]], [0.7936481907936148, ["writings", "mss11049.mss11049-006_00652_00705", "45_46_47_48"]], [0.7929740577577562, ["writings", "mss11049.mss11049-007_00242_00289", "38_39_40"]], [0.7929696327667786, ["writings", "mss11049.mss11049-007_00242_00289", "16_17"]], [0.7929246896563176, ["writings", "mss11049.mss11049-007_00182_00198", "6_7_9_10"]], [0.7909397290039755, ["writings", "mss11049.mss11049-007_00114_00160", "13_14_15_16"]], [0.7909175867610896, ["writings", "mss11049.mss11049-007_00242_00289", "35_36_37"]], [0.7908831126455458, ["writings", "mss11049.mss11049-006_00652_00705", "41_42_43_44"]], [0.7902814403741998, ["writings", "mss11049.mss11049-007_00242_00289", "29_30"]], [0.7859386637538953, ["writings", "mss11049.mss11049-007_00242_00289", "2_3_4_5"]]], "correspondence": [[0.7895447138172156, ["correspondence", "mss11049.mss11049-001_00011_00237", "138_139_140_141_142"]], [0.7803374972424921, ["correspondence", "mss11049.mss11049-001_00011_00237", "179_180_181_182_183"]], [0.7723148008203081, ["correspondence", "mss11049.mss11049-001_00011_00237", "161"]], [0.7675814964563417, ["correspondence", "mss11049.mss11049-001_00011_00237", "87_88"]], [0.7673189945773291, ["correspondence", "mss11049.mss11049-001_00011_00237", "8_9_10"]], [0.7644436405722254, ["correspondence", "mss11049.mss11049-001_00011_00237", "224_225_226_227"]], [0.7632795619073737, ["correspondence", "mss11049.mss11049-001_00011_00237", "59_60"]], [0.7598437549143633, ["correspondence", "mss11049.mss11049-001_00011_00237", "49_50_51_52_53"]], [0.7593924866730676, ["correspondence", "mss11049.mss11049-001_00011_00237", "164_165_166"]], [0.7587500608914792, ["correspondence", "mss11049.mss11049-001_00011_00237", "21_22_23"]]]}, "digital_id": "mss11049.mss11049-003_00768_00999", "file_id": 232, "page": "https://tile.loc.gov/image-services/iiif/service:mss:mss11049:mss11049-003:00999/full/pct:6.25/0/default.jpg", "entry_id": 1}